/* 
  Strings for the File Provider extension's info.plist
*/

/* Tooltip for files and folders in the pinned state */
"Pinned" = "Pinned";

/* Tooltip for files and folders in the syncing state */
"Syncing" = "Syncing";

/* A right click context menu option displayed when the user right clicks a file that OneDrive is syncing and the Mac Files on Demand (Placeholders) feature is enabled. This command lets the user indicate that they want to keep the content of this file or folder on disk. This translates to hydrating any files or folders that are dehydrated and setting the pin state to pinned on them. */
"Always Keep on This Device" = "Always Keep on This Device";

/* A right click context menu option displayed when the user right clicks a file that OneDrive is syncing and the Mac Files on Demand (Placeholders) feature is enabled. This command lets the user indicate that they want to free up space and therefore not store the content of this file or folder on disk. This translates to dehydrating any files or folders that are not already dehydrated and setting the pin state to unpinned on them. */
"Free Up Space" = "Free Up Space";
